MobileOTPIntegration/bin/main/getOTPRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:us="http://techprimers.com/spring-boot-soap-example">
    <soapenv:Header/>
    <soapenv:Body>
        <us:getMobileOTPRequest>
            <us:phoneNumber>Pratik</us:phoneNumber>
            <us:amount>550</us:amount>
        </us:getMobileOTPRequest>
    </soapenv:Body>
</soapenv:Envelope>

